12/data/attachments/d165b0b09f5aa3c2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Gregory_his_Friend_97209_3</nif:username>
            <nif:friendToBeRequested>soap_friends_fd25bb4d-253c-4c0f-9cdd-228e9f773737</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>